
public class Grammar {

	public static void main(String[] args) {
		
//		제네릭의 장점 : 컴파일 시에 타입이 결정되어 보다 안전한 프로그래밍 가능.
//					런타임 타입 충돌 문제 방지.
//					ClassCastExeption방지.
		
		
//		DB 의 역사
//		1. TEXT파일에 데이터를 저장하던 시기
//		2. 데이터의 양이 많아짐에따라 검색에 어려움이 생김 >> index를 도입. ISAM(Indexed Sequential Access Method)
//		3. DB가 도입. RDB(관계형 데이터베이스)
//		
//		스트림 입출력 : 버퍼를 가지고 순차적으로 이루어지는 입출력
//		자바의 입출력 스트림 : 응용프로그램과 입출력 장치를 연결하는 소프트웨어 모듈
//						입력스트림 : 입력장치로부터 자바 프로그램으로 데이터를 전달
//						출력스트림 : 자바 응용프로그램에서 출력장치로 데이터 출력
//		* 입출력에서 기준은 자바 응용프로그램이다.
//		스트림의 기본 단위 : 바이트.
//		스트림은 선입선출 구조를 갖는다 >> 큐
//		FileReader fin = new FileReader("경로");
//		입출력 순서
//		1. open(생략)
//		2. 사용
//		3. close
//		입출력 작업은 예외처리가 거의 필수적.
		
						
		
		

	}

}
