
public class Grammar {
	
//	SIUD >> Select / Insert / Update / Delete
//	
//	ERD >> Entity(class와 같은것. 설계도) / Relationship / Diagram
//	: ERD는 말로서 되어있는 요구분석사항을 그림으로 그려내어 그 관계를 도출하는 것이다.
//	'ERD'는 전략적 계획이나 또는 하향식 계획에서 자주 사용되며, 개략적인 상부계층의 데이터 다이어그램이다.
//		
//	테이블이란, Entity(설계도)를 통해 그린것을 말함.
//	
//	PK(Primary Key) : 특벼한 의미를 지닌 키.(열) >> 중복이 되면 안된다.*** 자신이 직접 정하는 것
//	
//	FK(Foreign Key) : 참조키 라고도함. 이는 다른테이블의 PK를 가져와서 쓰는 키이다. 참조키를 사용하게 되면, 잘못된 정보입력을 막아줌.
//	
//	CK(Composite Key) : 복합키. 이를테면, 강의가 열릴때 하나의 과목 코드를 두명이 중복해서 사용할 때 혹은 동명이인이 존재할 때 사용할 수 있음. 두개의 요소를 복합해서 설정함.
//	
//	--------- 2 ----------
//	
//	오라클 데이터베이스 자료형
//	1. VARCHAR2(길이) : 4000byte만큼의 가변 길이 문자열 데이터를 저장
//	++ nVARCHAR2 >> n : national. 즉, 다국어를 표현. 유니코드처럼 여러 언어를 통합해서 사용
//	
//	2. NUMBER(전체 자릿수, 소수점 이하 자릿수) : +- 38자릿수의 숫자를 저장. NUMBER(p,s)와 같이 표기할 경우 s자리만큼 소숫점 이하 자릿수 표현
//										 하고, 이 소수점 자리를 포함한 전체 p 자리만큼 숫자 데이터를 저장
//	3. DATE : 날짜 형식을 저장하기 위해 사용하는 자료형
//	
//	
//	PL / SQL >> 오라클 전용!
//	: Procedural Language Extension to SQL
//	  변수, 조건문, 반복문 등 존재 >> 자바가 처리하는 로직을 대신 처리
//	
//	---------- 3 ----------
	
	
	
	
	
	
										 
	
	
}
